# Pandas入门及实践

Pandas 是基于 NumPy 的一个开源 Python 库，它被广泛用于快速分析数据，以及数据清洗和准备等工作。它的名字来源是由“ Panel data”（面板数据，一个计量经济学名词）两个单词拼成的。简单地说，你可以把 Pandas 看作是 Python 版的 Excel。

<img src='./image/pandas.png' />

Pandas非常酷，它能很好地处理来自一大堆各种不同来源的数据，比如 Excel 表格、CSV 文件、SQL 数据库，甚至还能处理存储在网页上的数据。

此外，因为pandas基于Numpy，所以执行效率非常快。比如把几十个结构一致的csv文件合并为200M左右的单个文件（主要数据都是字符串文本），然后在此基础上做各个数据点的分组统计与分析，执行速度是秒级别的。

## 1. 安装

如果安装anaconda，安装命令为：```conda install pandas```

如果没有安装anaconda，安装命令为：```pip install pandas```

## 2. Pandas数据结构

Series 是一种<b>一维数组</b>，和 NumPy 里的数组很相似。事实上，Series 基本上就是基于 NumPy 的数组对象来的。和 NumPy 的数组不同，Series 能为数据自定义标签，也就是索引（index），然后通过索引来访问数组中的数据。

下面我们来实战部分，在python的世界里，numpy惯例缩写为np，pandas惯例缩写为pd

In [18]:
import numpy as np
import pandas as pd

### 2.1 Series

创建一个Series的基本语法如下：

```series = pd.Series(data, index)```

上面的 data 参数可以是任意数据对象，比如字典、列表甚至是 NumPy 数组，而index 参数则是对 data 的索引值，类似字典的 key。

下面这个例子里，将创建一个 Series 对象，并用字符串对数字列表进行索引：

In [2]:
countries = ['USA', 'France', 'China']
my_data = [100, 200, 300]

In [3]:
pd.Series(my_data, countries)

USA       100
France    200
China     300
dtype: int64

注意：请记住， index 参数是可省略的，你可以选择不输入这个参数。如果不带 index 参数，Pandas 会自动用默认 index 进行索引，类似数组，索引值是 [0, ..., len(data) - 1] ，如下所示：

基于numpy的array创建Series

In [4]:
array = np.array(my_data)

In [5]:
pd.Series(array)

0    100
1    200
2    300
dtype: int32

基于字典对象创建Series <br>
如果从一个python字典对象创建Series，Pandas会自动把字典的键值设置成Series的index，并将对应的value放在和索引对应的data里。

In [7]:
my_dict = {'a': 50, 'b': 60, 'c' : 70, 'd' : 80}

In [8]:
pd.Series(my_dict)

a    50
b    60
c    70
d    80
dtype: int64

与Numpy数组不同，Pandas的Series能存放各种不同类型的对象。

从Series里获取数据，和python字典基本一样：

In [10]:
countries = ['USA', 'France', 'China']
my_data = [100, 200, 300]
series = pd.Series(my_data, countries)
series['USA']

100

对Series进行算术运算操作

对 Series 的算术运算都是基于 index 进行的。我们可以用加减乘除（+ - * /）这样的运算符对两个 Series 进行运算，Pandas 将会根据索引 index，对响应的数据进行计算，结果将会以浮点数的形式存储，以避免丢失精度。

In [13]:
series1 = pd.Series([1, 2, 3, 4], ['London', 'HongKong', 'Shanghai', 'Shenzhen'])
series2 = pd.Series([5, 6, 7, 8], ['London', 'Shenzhen', 'NewYork', 'Delhi'])

In [14]:
series1 - series2

Delhi       NaN
HongKong    NaN
London     -4.0
NewYork     NaN
Shanghai    NaN
Shenzhen   -2.0
dtype: float64

In [15]:
series1 + series2

Delhi        NaN
HongKong     NaN
London       6.0
NewYork      NaN
Shanghai     NaN
Shenzhen    10.0
dtype: float64

In [16]:
series1 * series2

Delhi        NaN
HongKong     NaN
London       5.0
NewYork      NaN
Shanghai     NaN
Shenzhen    24.0
dtype: float64

In [17]:
series1 / series2

Delhi            NaN
HongKong         NaN
London      0.200000
NewYork          NaN
Shanghai         NaN
Shenzhen    0.666667
dtype: float64

如上，如果 Pandas 在两个 Series 里找不到相同的 index，对应的位置就返回一个空值 NaN。

### 2.2 DataFrames

Pandas 的 DataFrame（数据表）是一种 2 维数据结构，数据以表格的形式存储，分成若干行和列。通过 DataFrame，你能很方便地处理数据。常见的操作比如选取、替换行或列的数据，还能重组数据表、修改索引、多重筛选等。

构建一个 DataFrame 对象的基本语法如下：```DataFrame(data=[],index=[],coloumns=[])```

举个例子，我们可以创建一个 5 行 4 列的 DataFrame，并填上随机数据：

In [24]:
np.random.seed(100)
dataframe = pd.DataFrame(data=np.random.randint(low=1, high=10, size=(5, 4)))
print(dataframe)

   0  1  2  3
0  9  9  4  8
1  8  1  5  3
2  6  3  3  3
3  2  1  9  5
4  1  7  3  5

该dataframe中的每一列基本上就是一个 Series ，它们都用了同一个 index。因此，我们基本上可以把 DataFrame 理解成一组采用同样索引的 Series 的集合。

下面这个例子里，我们将用许多 Series 来构建一个DataFrame：

In [25]:
df = {'name': pd.Series(['Jon', 'Aaron', 'Tod'], index=['a', 'b', 'c']),
     'age': pd.Series(['39', '28', '17', '25'], index=['a', 'b', 'c', 'd']),
     'nationality': pd.Series(['US', 'China', 'US'], ['a', 'b', 'c'])}
pd.DataFrame(df)

    name age nationality
a    Jon  39          US
b  Aaron  28       China
c    Tod  17          US
d    NaN  25         NaN

下面的例子是用一个字典来创建DataFrame: (需要注意的是，索引与字典中各个key对应的value的数量必须相等)

In [46]:
data = {'name': ['Jon', 'Aaron', 'Tod'],
     'age': ['39', '28', '17'],
     'nationality': ['US', 'China', 'US']}
my_df = pd.DataFrame(data, 
                     index=['Lagos', 'Dubai', 'Mumbai'])
my_df

         name age nationality
Lagos     Jon  39          US
Dubai   Aaron  28       China
Mumbai    Tod  17          US

获取DataFrame中的列

要获取一列的数据，还是用中括号 [] 的方式，跟 Series 类似。比如尝试获取上面这个表中的 name 列数据：

In [47]:
my_df['name']

Lagos       Jon
Dubai     Aaron
Mumbai      Tod
Name: name, dtype: object

因为我们只获取一列，所以返回的就是一个 Series。可以用 type() 函数确认返回值的类型：

In [48]:
type(my_df['name'])

pandas.core.series.Series

如果获取多个列，那返回的就是一个 DataFrame 类型：

In [49]:
my_df[['name', 'age']]

         name age
Lagos     Jon  39
Dubai   Aaron  28
Mumbai    Tod  17

In [50]:
type(my_df[['name', 'age']])

pandas.core.frame.DataFrame

向 DataFrame 里增加数据列

创建一个列的时候，你需要先定义这个列的数据和索引。举个栗子，比如这个 DataFrame：

In [51]:
my_df

         name age nationality
Lagos     Jon  39          US
Dubai   Aaron  28       China
Mumbai    Tod  17          US

增加数据列有两种办法：可以从头开始定义一个 pd.Series，再把它放到表中，也可以利用现有的列来产生需要的新列。比如下面两种操作：

定义一个 Series ，并放入 'year' 列中：

In [52]:
my_df['year'] = pd.Series(['2016', '2017', '2018'], ['Lagos', 'Dubai', 'Mumbai'])
my_df

         name age nationality  year
Lagos     Jon  39          US  2016
Dubai   Aaron  28       China  2017
Mumbai    Tod  17          US  2018

从现有的列创建新列：

In [53]:
my_df['age_year'] = my_df['age'] + my_df['year']
my_df

         name age nationality  year age_year
Lagos     Jon  39          US  2016   392016
Dubai   Aaron  28       China  2017   282017
Mumbai    Tod  17          US  2018   172018

从 DataFrame 里删除行/列

想要删除某一行或一列，可以用 .drop() 函数。在使用这个函数的时候，你需要先指定具体的删除方向，axis=0 对应的是行 row，而 axis=1 对应的是列 column 。

删除 'age_year' 列：

In [54]:
my_df.drop('age_year', axis=1)

         name age nationality  year
Lagos     Jon  39          US  2016
Dubai   Aaron  28       China  2017
Mumbai    Tod  17          US  2018

删除'Dubai'行：

In [55]:
my_df.drop('Dubai', axis=0)

       name age nationality  year age_year
Lagos   Jon  39          US  2016   392016
Mumbai  Tod  17          US  2018   172018

请务必记住，除非用户明确指定，否则在调用 .drop() 的时候，Pandas 并不会真的永久性地删除这行/列。这主要是为了防止用户误操作丢失数据。

你可以通过调用 df 来确认数据的完整性。如果你确定要永久性删除某一行/列，现在my_df数据并没有发生变化：

In [57]:
my_df

         name age nationality  year age_year
Lagos     Jon  39          US  2016   392016
Dubai   Aaron  28       China  2017   282017
Mumbai    Tod  17          US  2018   172018

你需要加上 inplace=True 参数，比如：

In [58]:
my_df.drop('Dubai', axis=0, inplace=True)
my_df

       name age nationality  year age_year
Lagos   Jon  39          US  2016   392016
Mumbai  Tod  17          US  2018   172018

获取 DataFrame 中的一行或多行数据

要获取某一行，你需要用 .loc[] 来按索引（标签名）引用这一行，或者用 .iloc[]，按这行在表中的位置（行数）来引用。

In [64]:
my_df.loc['Lagos']

name              Jon
age                39
nationality        US
year             2016
age_year       392016
Name: Lagos, dtype: object

In [65]:
my_df.loc[['Lagos', 'Mumbai']]

       name age nationality  year age_year
Lagos   Jon  39          US  2016   392016
Mumbai  Tod  17          US  2018   172018

In [63]:
my_df.iloc[0]

name              Jon
age                39
nationality        US
year             2016
age_year       392016
Name: Lagos, dtype: object

In [66]:
my_df.iloc[[0, 1]]

       name age nationality  year age_year
Lagos   Jon  39          US  2016   392016
Mumbai  Tod  17          US  2018   172018

同时你可以用 .loc[] 来指定具体的行列范围，并生成一个子数据表，就像在 NumPy里做的一样。比如，提取 'Lagos' 行中 'Name’ 列的内容，可以如下操作：

In [70]:
my_df.loc['Lagos', 'name']

'Jon'

In [74]:
type(my_df.loc['Lagos', 'name'])

str

此外，你还可以制定多行和/或多列, 此时得到的是DataFrame

In [75]:
my_df.loc[['Lagos', 'Mumbai'], ['name', 'age']]

       name age
Lagos   Jon  39
Mumbai  Tod  17

In [76]:
type(my_df.loc[['Lagos', 'Mumbai'], ['name', 'age']])

pandas.core.frame.DataFrame

条件筛选

用中括号 [] 的方式，除了直接指定选中某些列外，还能接收一个条件语句，然后筛选出符合条件的行/列。比如，我们希望在下面这个表格中筛选出 'W'>0 的行：

In [127]:
np.random.seed(100)
df = pd.DataFrame(data=np.random.randn(5, 4), 
                  index=['a', 'b', 'c', 'd', 'e'], 
                  columns=['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

In [128]:
df[df['X'] > 0.5]

          W         X         Y         Z
b  0.981321  0.514219  0.221180 -1.070043
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

只看W列中，X > 0.5的数据：

In [129]:
df[df['X'] > 0.5]['W']

b    0.981321
d   -0.583595
e   -0.531280
Name: W, dtype: float64

类似的，你还可以试试这样的语句 ```df[df['X']>0.5][['X','Y']]``` ，结果将会是这样：

In [130]:
df[df['X']>0.5][['X','Y']]

          X         Y
b  0.514219  0.221180
d  0.816847  0.672721
e  1.029733 -0.438136

相当于将下面操作连在一起

In [131]:
myseries = df['X'] > 0.5
result = df[myseries]
mycols = ['X', 'Y']
result[mycols]

          X         Y
b  0.514219  0.221180
d  0.816847  0.672721
e  1.029733 -0.438136

你可以用逻辑运算符 &（与）和 |（或）来链接多个条件语句，以便一次应用多个筛选条件到当前的 DataFrame 上。举个栗子，你可以用下面的方法筛选出同时满足 'W'>0 和'X'>1 的行：

In [132]:
df[(df['W'] > 0) & (df['X'] > 0.5)]

          W         X        Y         Z
b  0.981321  0.514219  0.22118 -1.070043

重置 DataFrame 的索引

如果你觉得当前 DataFrame 的索引有问题，你可以用 .reset_index() 简单地把整个表的索引都重置掉。这个方法将把目标 DataFrame 的索引保存在一个叫 index 的列中，而把表格的索引变成默认的从零开始的数字，也就是 [0, ..., len(data) - 1] 。比如下面这样：

In [133]:
df.reset_index()

  index         W         X         Y         Z
0     a -1.749765  0.342680  1.153036 -0.252436
1     b  0.981321  0.514219  0.221180 -1.070043
2     c -0.189496  0.255001 -0.458027  0.435163
3     d -0.583595  0.816847  0.672721 -0.104411
4     e -0.531280  1.029733 -0.438136 -1.118318

和删除操作差不多，.reset_index() 并不会永久改变你表格的索引，除非你调用的时候明确传入了 inplace 参数，比如：.reset_index(inplace=True)

In [134]:
df

          W         X         Y         Z
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

In [135]:
df.reset_index(inplace=True)

In [136]:
df

  index         W         X         Y         Z
0     a -1.749765  0.342680  1.153036 -0.252436
1     b  0.981321  0.514219  0.221180 -1.070043
2     c -0.189496  0.255001 -0.458027  0.435163
3     d -0.583595  0.816847  0.672721 -0.104411
4     e -0.531280  1.029733 -0.438136 -1.118318

注意：原有的索引会作为一个备份列，列名为index, 出现在DataFrame中

In [138]:
df.columns

Index(['index', 'W', 'X', 'Y', 'Z'], dtype='object')

设置 DataFrame 的索引值

类似地，我们还可以用 .set_index() 方法，将 DataFrame 里的某一列作为索引来用。比如，我们在这个表里新建一个名为 "ID" 的列：

In [139]:
df['ID'] = ['id1', 'id2', 'id3', 'id4', 'id5']
df

  index         W         X         Y         Z   ID
0     a -1.749765  0.342680  1.153036 -0.252436  id1
1     b  0.981321  0.514219  0.221180 -1.070043  id2
2     c -0.189496  0.255001 -0.458027  0.435163  id3
3     d -0.583595  0.816847  0.672721 -0.104411  id4
4     e -0.531280  1.029733 -0.438136 -1.118318  id5

In [140]:
df.set_index('ID')

    index         W         X         Y         Z
ID
id1     a -1.749765  0.342680  1.153036 -0.252436
id2     b  0.981321  0.514219  0.221180 -1.070043
id3     c -0.189496  0.255001 -0.458027  0.435163
id4     d -0.583595  0.816847  0.672721 -0.104411
id5     e -0.531280  1.029733 -0.438136 -1.118318

同样的，这种做法也不会直接修改df的索引，依然需要设置inplace

In [141]:
df

  index         W         X         Y         Z   ID
0     a -1.749765  0.342680  1.153036 -0.252436  id1
1     b  0.981321  0.514219  0.221180 -1.070043  id2
2     c -0.189496  0.255001 -0.458027  0.435163  id3
3     d -0.583595  0.816847  0.672721 -0.104411  id4
4     e -0.531280  1.029733 -0.438136 -1.118318  id5

In [142]:
df.set_index('ID', inplace=True)

In [143]:
df

    index         W         X         Y         Z
ID
id1     a -1.749765  0.342680  1.153036 -0.252436
id2     b  0.981321  0.514219  0.221180 -1.070043
id3     c -0.189496  0.255001 -0.458027  0.435163
id4     d -0.583595  0.816847  0.672721 -0.104411
id5     e -0.531280  1.029733 -0.438136 -1.118318

注意：set_index，不会保留原有索引的备份，会直接将原有索引替代为新的索引

多级索引（MultiIndex）以及命名索引的不同等级

多级索引其实就是一个由元组（Tuple）组成的数组，每一个元组都是独一无二的。你可以从一个包含许多数组的列表中创建多级索引（调用 MultiIndex.from_arrays ），也可以用一个包含许多元组的数组（调用 MultiIndex.from_tuples ）或者是用一对可迭代对象的集合（比如两个列表，互相两两配对）来构建（调用MultiIndex.from_product ）。

下面这个例子，我们从元组中创建多级索引：

In [144]:
outside = ['0 level', '0 level', '0 level', 'A level', 'A level', 'A level',]
inside = [21, 22, 23, 21, 22, 23]
myindex = list(zip(outside, inside))

In [145]:
myindex

[('0 level', 21),
 ('0 level', 22),
 ('0 level', 23),
 ('A level', 21),
 ('A level', 22),
 ('A level', 23)]

最后这个 list(zip()) 的嵌套函数，把上面两个列表合并成了一个每个元素都是元组的列表。这时 my_index 的内容如上所示。

接下来，我们调用 .MultiIndex.from_tuples(my_index) 生成一个多级索引对象：

In [146]:
myindex = pd.MultiIndex.from_tuples(myindex)
myindex

MultiIndex(levels=[['0 level', 'A level'], [21, 22, 23]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [150]:
type(myindex)

pandas.core.indexes.multi.MultiIndex

最后，将这个多级索引对象转成一个 DataFrame：

In [149]:
np.random.seed(100)
df = pd.DataFrame(np.random.randn(6, 2), index=myindex, columns=['A', 'B'])
df

                   A         B
0 level 21 -1.749765  0.342680
        22  1.153036 -0.252436
        23  0.981321  0.514219
A level 21  0.221180 -1.070043
        22 -0.189496  0.255001
        23 -0.458027  0.435163

要获取多级索引中的数据，还是用到 .loc[] 。比如，先获取 'O Level' 下的数据：

In [154]:
df.loc['0 level']

           A         B
21 -1.749765  0.342680
22  1.153036 -0.252436
23  0.981321  0.514219

然后再用一次 .loc[]，获取下一层 21 里的数据：

In [153]:
df.loc['0 level'].loc[21]

A   -1.749765
B    0.342680
Name: 21, dtype: float64

如上所示，df 这个 DataFrame 的头两个索引列没有名字，看起来不太易懂。我们可以用 .index.names 给它们加上名字：

In [155]:
df.index.names = ['level', 'num']

In [156]:
df

                    A         B
level   num
0 level 21  -1.749765  0.342680
        22   1.153036 -0.252436
        23   0.981321  0.514219
A level 21   0.221180 -1.070043
        22  -0.189496  0.255001
        23  -0.458027  0.435163

In [157]:
df.columns

Index(['A', 'B'], dtype='object')

交叉选择行和列中的数据

我们可以用 .xs() 方法轻松获取到多级索引中某些特定级别的数据。比如，我们需要找到所有 Levels 中，Num = 22 的行：

In [158]:
df.xs(22, level='num')

                A         B
level
0 level  1.153036 -0.252436
A level -0.189496  0.255001

清洗数据

删除或填充空值

在许多情况下，如果你用 Pandas 来读取大量数据，往往会发现原始数据中会存在不完整的地方。在 DataFrame 中缺少数据的位置， Pandas 会自动填入一个空值，比如 NaN或 Null 。因此，我们可以选择用 .dropna() 来丢弃这些自动填充的值，或是用.fillna() 来自动给这些空值填充数据。

比如这个例子：

In [159]:
dt = {'A':[1, np.nan, 3], 'B':[2, np.nan, np.nan], 'C':[4, 5, 6]}
df = pd.DataFrame(dt)
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

当你使用 .dropna() 方法时，就是告诉 Pandas 删除掉存在一个或多个空值的行（或者列）。删除列用的是 .dropna(axis=1) ，删除行用的是 .dropna(axis=0) 。

请注意，如果你没有指定 axis 参数，默认是删除行。

删除行：

In [168]:
df.dropna()

     A    B  C
0  1.0  2.0  4

In [169]:
df.dropna(axis=0)

     A    B  C
0  1.0  2.0  4

注意：DataFrame的删除操作，并不会永久删除数据，依然需要加入inplace=True

In [170]:
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

删除列：

In [171]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

类似的，如果你使用 .fillna() 方法，Pandas 将对这个 DataFrame 里所有的空值位置填上你指定的默认值。比如，将表中所有 NaN 替换成 20 ：

In [172]:
df.fillna(20)

      A     B  C
0   1.0   2.0  4
1  20.0  20.0  5
2   3.0  20.0  6

当然，这有的时候打击范围太大了。于是我们可以选择只对某些特定的行或者列进行填充。比如只对 'A' 列进行操作，在空值处填入该列的平均值：

In [174]:
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

In [176]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

如上所示，'A' 列的平均值是 2.0，所以第二行的空值被填上了 2.0。

同理，.dropna() 和 .fillna() 并不会永久性改变你的数据，除非你传入了inplace=True 参数。

分组统计

Pandas 的分组统计功能可以按某一列的内容对数据行进行分组，并对其应用统计函数，比如求和，平均数，中位数，标准差等等…

举例来说，用 .groupby() 方法，我们可以对下面这数据表按 'Company' 列进行分组，并用 .mean() 求每组的平均值：

首先，初始化一个DataFrame：

In [181]:
dt = {'company':['a', 'a', 'a', 'b', 'b'], 
      'person': ['Ali', 'Bale', 'Alice', 'Charlie', 'David'], 
      'sale': [105, 126, 158, 321, 256], 'asset': [1045, 1268, 2053, 3158, 2890]}
df = pd.DataFrame(dt)
df

  company   person  sale  asset
0       a      Ali   105   1045
1       a     Bale   126   1268
2       a    Alice   158   2053
3       b  Charlie   321   3158
4       b    David   256   2890

根据company分组，求所有的数字列求均值

In [183]:
df.groupby('company').mean()

               sale        asset
company
a        129.666667  1455.333333
b        288.500000  3024.000000

计数

用 .count() 方法，能对 DataFrame 中的某个元素出现的次数进行计数。

In [187]:
df.count()

company    5
person     5
sale       5
asset      5
dtype: int64

In [189]:
df.count(numeric_only=True)

sale     5
asset    5
dtype: int64

数据描述

与Numpy类似，Pandas也有多个描述性的统计指标方法。

Pandas 的 .describe() 方法将对 DataFrame 里的数据进行分析，并一次性生成多个描述性的统计指标，方便用户对数据有一个直观上的认识。

对于非分组列，将统计该列的条目，唯一值的数量，出现频率最多的值，以及出现频率数量：

In [191]:
df['company'].describe()

count     5
unique    2
top       a
freq      3
Name: company, dtype: object

对于分组数据，生成的指标，从左到右分别是：计数、平均数、标准差、最小值、25% 50% 75% 位置的值、最大值。

In [193]:
df.groupby('company').describe()

        asset                                                           \
        count         mean         std     min     25%     50%     75%
company
a         3.0  1455.333333  529.467972  1045.0  1156.5  1268.0  1660.5
b         2.0  3024.000000  189.504617  2890.0  2957.0  3024.0  3091.0

                 sale                                                       \
            max count        mean        std    min     25%    50%     75%
company
a        2053.0   3.0  129.666667  26.689573  105.0  115.50  126.0  142.00
b        3158.0   2.0  288.500000  45.961941  256.0  272.25  288.5  304.75


           max
company
a        158.0
b        321.0

如果你不喜欢这个排版，你可以用 .transpose() 方法获得一个竖排的格式：

In [194]:
df.groupby('company').describe().transpose()

company                a            b
asset count     3.000000     2.000000
      mean   1455.333333  3024.000000
      std     529.467972   189.504617
      min    1045.000000  2890.000000
      25%    1156.500000  2957.000000
      50%    1268.000000  3024.000000
      75%    1660.500000  3091.000000
      max    2053.000000  3158.000000
sale  count     3.000000     2.000000
      mean    129.666667   288.500000
      std      26.689573    45.961941
      min     105.000000   256.000000
      25%     115.500000   272.250000
      50%     126.000000   288.500000
      75%     142.000000   304.750000
      max     158.000000   321.000000

也可以只统计某个数据项(将获得Series)

In [207]:
df.groupby('company').describe().transpose()['a']

asset  count       3.000000
       mean     1455.333333
       std       529.467972
       min      1045.000000
       25%      1156.500000
       50%      1268.000000
       75%      1660.500000
       max      2053.000000
sale   count       3.000000
       mean      129.666667
       std        26.689573
       min       105.000000
       25%       115.500000
       50%       126.000000
       75%       142.000000
       max       158.000000
Name: a, dtype: float64